INSERT INTO question (question, choice1, choice2, choice3, choice4, answer, question_type)
VALUES
	("ディレクトリ（フォルダ）を作成するコマンドは？", "cd", "mkdir", "touch", "ls", "mkdir", "GIT/CL"),
	("ファイル、ディレクトリを移動させる　ファイル名、ディレクトリ名を変更するコマンドは？", "mv", "touch", "change", "grep", "mv", "GIT/CL"),
	("ディレクトリを移動するコマンドは？", "mv", "ls", "dir", "cd", "cd", "GIT/CL"),
	("git () リモート ブランチ ()に当てはまるリモートリポジトリに差分をアップするコマンドは？", "up", "remote", "push", "pull", "pull", "GIT/CL"),
	("git () ()に当てはまる、ローカルで変更したステージングされていないファイルを表示するコマンドは？", "status", "diff", "change", "pull", "status", "GIT/CL"),
	("カラム について説明があっているものを選択しなさい", "データベースにおける縦の列", "データベースにおける横の行", "データベースにおける表全体", "データベースにおける1つのセル", "データベースにおける縦の列", "SQL"),
	("クエリ について説明があっているものを選択しなさい", "JQueryとデータベースの連携のこと", "データベースに送る命令のこと", "データベースを削除すること", "データベースに入っている情報のこと ", "データベースに送る命令のこと", "SQL"),
	("MySQL について説明があっているものを選択しなさい", "開発で自分が使っているデータベースのこと", "データベースの種類の一つ ", "データベースを比較検討できるサイトの名前 ", "自分かデータベースに書き込んだデータのこと", "データベースの種類の一つ ", "SQL"),
	("ある文字を含むデータを取得するときに使うSQLはどれか", "比較演算子", "LIKE演算子", "AND演算子", "OR演算子", "LIKE演算子", "SQL"),
	("ORDER BY の説明として正しいのはどれか ", "特定のデータを取得する ", "重複するデータを除く ", "データを並び替える", "データをグループ化する", "データを並び替える", "SQL"),
	("リンクを作成する場合、正しいものはどれか", "<p href=”https://oplan.co.jp/”>オープラン株式会社</p>", "<a href=”https://oplan.co.jp/”>オープラン株式会社</a>", "<img src=”https://oplan.co.jp/”>オープラン株式会社</img> ", "<h6 =”https://oplan.co.jp/”>オープラン株式会社</h6>", "<a href=”https://oplan.co.jp/”>オープラン株式会社</a>", "HTML/CSS"),
	("<ul>要素に関する説明として正しいものはどれか", "<ul>要素で囲むと、ブラウザのタブ上に現れる", "<ul>要素で囲むと、ブラウザに表示されない", "<ul>要素で囲むと、数字が連番でつく", "<ul>要素で囲むと、黒点が先頭につく", "<ul>要素で囲むと、黒点が先頭につく", "HTML/CSS"),
	("背景画像を載せるときの正しいプロパティを選択しなさい ", "background-color", "background-color-position", "img", "background-image", "background-image", "HTML/CSS"),
	("一回のmarginですべて違う値で指定するときの順番を選択しなさい   (例：margin: 1px 2px 3px 4px;) ", "上右下左", "右上下左", "右左上下", "下上左右", "上右下左", "HTML/CSS"),
	("displayプロパティで領域そのものを表示しない値を選択しなさい", "inline", "none", "block", "list-item", "none", "HTML/CSS"),
	("不特定の数値や文字列などのデータが格納されたものの名前は？", "定数", "不定数", "変数", "浮動数", "変数", "PHP"),
	("特定の処理を一纏めにしたものの名前は？", "関数", "処理数", "定数", "変数", "関数", "PHP"),
	("1つのフルーツの名前を格納する変数の命名として適切なものはどれか", "フルーツ", "1fruit", "fruit", "furu-tu", "fruit", "PHP"),
	("インスタンスとクラスの関係性として正しいものを選びなさい。", "クラスを設計図として生成するのがインスタンス", "インスタンスを設計図として生成するのがクラス", "まったくの無関係", "外部からアクセスできる設計図がクラスでできないのがインスタンス", "クラスを設計図として生成するのがインスタンス", "PHP"),
	("以下のように作られた配列においてインドを表示しなさい。$country = array('日本', 'アメリカ', 'インド', 'イギリス');", "echo $country['インド'];", "echo '$country[2]';", "echo $country[2];", "echo country[2];", "echo $country[2];", "PHP");
	